In [1]:
import pandas as pd

In [2]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])
s

a    3
b   -5
c    7
d    4
dtype: int64

In [5]:
s[['a', 'd']]

a    3
d    4
dtype: int64

In [6]:
data = {'Country': ['Belgium', 'India', 'Brazil'],
           'Capital': ['Brussels', 'New Delhi', 'Brasília'],
           'Population': [11190846, 1303171035, 207847528]}

In [7]:
data

{'Capital': ['Brussels', 'New Delhi', 'Brasília'],
 'Country': ['Belgium', 'India', 'Brazil'],
 'Population': [11190846, 1303171035, 207847528]}

In [8]:
df = pd.DataFrame(data)
df

     Capital  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasília   Brazil   207847528

In [9]:
df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [17]:
df1 = df[['Country', 'Population']]
df1

   Country  Population
0  Belgium    11190846
1    India  1303171035
2   Brazil   207847528

In [14]:
df.iloc[0,0]

'Belgium'

In [16]:
# you get row 0
df.iloc[0,:]

Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object

In [19]:
df1.iloc[0,0] = 'Turkey'
df1

/anaconda3/lib/python3.6/site-packages/pandas/core/indexing.py:537: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

  Country  Population
0  Turkey    11190846
1   India  1303171035
2  Brazil   207847528

In [20]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [21]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [23]:
# Filter data
s[~(s > 1)]

b   -5
dtype: int64

In [26]:
s[(s < -1) & (s > 2)]

Series([], dtype: int64)

In [27]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [32]:
df[df.Population > 200000000]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

In [37]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [38]:
s.drop(['a'], inplace=True)

In [39]:
s

b   -5
c    7
d    4
dtype: int64

In [40]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [44]:
df.drop('Country', axis=1)

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

In [45]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [48]:
df.sort_values(by='Population', ascending=False)

   Country    Capital  Population
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528
0  Belgium   Brussels    11190846

In [49]:
df.shape

(3, 3)

In [50]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
Country       3 non-null object
Capital       3 non-null object
Population    3 non-null int64
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [55]:
df.describe()

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [56]:
df.mean()

Population    5.074031e+08
dtype: float64

In [58]:
df.Population.sum()

1522209409

In [59]:
def square(x):
    return 2*x

In [63]:
df['Population'] = df['Population'].apply(square)

In [64]:
df['Population']

0      22381692
1    2606342070
2     415695056
Name: Population, dtype: int64

In [65]:
df

   Country    Capital  Population
0  Belgium   Brussels    22381692
1    India  New Delhi  2606342070
2   Brazil   Brasília   415695056